// __________________________________________________ ИМПОРТЫ
const Router = require("express");

// __________________________________________________ ОБЪЕКТЫ
const router = new Router();

// __________________________________________________ КОНТРОЛЛЕРЫ
const AdminController = require("../Controllers/Admin.Controller"); // Контроллер аккаунта

// __________________________________________________ Middlewares

// __________________________________________________ Роутеры API
router.post("/login", AdminController.accessLogin);

// __________________________________________________ Экспорты
module.exports = router;
